#+TITLE: Invent-Your-Own-Computer-Games-With-Python
#+AUTHOR: lujun9972
#+CATEGORY: Programming, Python
#+DATE: [2016-05-03 周二 08:32]
#+OPTIONS: ^:{}

* 认识Python环境
** python的特点
** 下载与安装python
** 演示python
[[shell:cmd /c python][运行python]]
*** 数字计算
| 加法     | 3+2  |
| 减法     | 3-2  |
| 乘法     | 3*2  |
| 除法     | 3/2  |
| 整除     | 3//2 | 
*** 数字比较  
| 大于     | 3>2  |
| 小于     | 3<2  |
| 等于     | 3==2 |
| 大于等于 | 3>=2 |
| 小于等于 | ???  |
| 不等于   | 3!=2 |
*** 什么是变量,表达式,运算符,类型
+ 什么是变量?
+ 什么是运算符?
+ 什么是表达式?
+ 区分类型有什么意义?
+ python中的变量名要注意大小写
*** IDLE保持,运行程序
*** 如何写注释
=#= 符号表示一直到行尾的内容都是注释,注释是写给人看的解释性的语句,计算机不会被执行.
#+BEGIN_SRC python
  # 2+2 = ?
  print(2+2)
#+END_SRC

#+RESULTS:
: 4

* 字符串
** 字符串的字面量语法
+ '...'
+ "..."
+ '''...'''
+ r"..."
** 字符串的运算符
+ 加法
  #+BEGIN_SRC python 
  print("2" + "3")
  print(2+3)
  #+END_SRC

  #+RESULTS:
  : 23
  : 5

+ 乘法
  #+BEGIN_SRC python
    print("2" * 3)
    print(2 * 3)
  #+END_SRC

  #+RESULTS:
  : 222
  : 6

** print() 与 input() 函数
+ 什么是函数?

+ 如何调用函数

+ 給函数传递多个参数
  
+ 使用input函数输入外部数据,使用print函数输出要显示的数据.
  #+BEGIN_SRC python :session "string"
    print("What's your name?")
    name = input()
    DarkSun
    print("Oh,Hello",name)          # print函数可以接受多个参数,参数与参数之间用逗号分隔,输出时各参数之间自动加上空格分隔
  #+END_SRC

  #+RESULTS:
  : What's your name?>>> Oh,Hello DarkSun

+ 练习题
  
  上面那段代码,給print函数传递了两个参数用于输出. 你能把它修改为只传递一个参数,实现一样的输出吗?
  #+BEGIN_SRC python :session "string"
    greeting = ???
    print(greeting)
  #+END_SRC
  
  试试給input函数传递一个字符串作为参数,看看会有什么结果,你能把上面例子中的
  #+BEGIN_SRC python :session "string"
    print("What's your name?")
    name = input()
  #+END_SRC
  合并成一个语句吗?
  #+BEGIN_SRC python :session "string"
  ???
  #+END_SRC

** 字符串的常用方法
+ int/float
+ 字符串大小写切换
+ format方法
+ substring
+ len

* 第一个游戏:猜数字
** 源代码展示
#+BEGIN_SRC python :tangle "samples/guess.py"

#+END_SRC
** import语句
+ 什么是module?
  #+BEGIN_QUOTE
  While Python includes many built-in functions, some functions exist in separate programs called modules. 
  Modules are Python programs that contain additional functions. 
  #+END_QUOTE

+ 使用import语句能够使用其他程序中定义好的函数
  
  import语法为 =import 模块名=
  #+BEGIN_SRC python :session "guess-number"
    import random
    print(random.randint(1,10))
  #+END_SRC

  #+RESULTS:
  : 3

** random模块
+ random.randint函数获得两个正整数之间的随机整数
  #+BEGIN_SRC python :session "guess-number"
    print(random.randint(1,10))
  #+END_SRC

  #+RESULTS:
  : 10

** while循环
+ python中的代码块
  
* Local Variables Setting
# Local Variables:
# org-babel-default-header-args:python: ((:session . "none") (:results . "output") (:exports . "code") (:cache))
# org-babel-python-command: "python3"
# End:
